app/Http/View/Composers/HomeComposer.php

    public function __construct(Banner $banners, Partner $partners, Category $categories, Post $post)
    {
        $this->banners  = $banners::where('active', '=', 1)->get();
        $this->partners = $partners::where('active', '=', 1)->get();
        $this->feature_categories = $categories::where('show_branner', '=', 1)->latest()->get();
---
select * from `banners` where `active` = 1
select * from `partners` where `active` = 1
select * from `categories` where `show_branner` = 1 and `categories`.`deleted_at` is null order by `created_at` desc