app/Http/Controllers/OptionTypeController.php

select * from `options` where `options`.`option_type_id` = 1 and `options`.`option_type_id` is not null
select `option_types`.*, `category_optiontypes`.`category_id` as `pivot_category_id`, `category_optiontypes`.`option_type_id` as `pivot_option_type_id` from `option_types` inner join `category_optiontypes` on `option_types`.`id` = `category_optiontypes`.`option_type_id` where `category_optiontypes`.`category_id` = 2
---
    public function option_types_by_category_id(Category $category){
        $admin = \Auth::guard('admin')->user();
        $admin_locale = $admin->settings['locale'] ?? 'ru';
        $option_type = $category->optionTypes;
        $option_type = $option_type->map(function ($item, $key) use ($admin_locale){
           $item = $item->only([ 'id' , 'name', 'slug', 'pivot', 'translations', 'optionsWithTranslations']);
           $item['translations'] = $item['translations']->map(function ($item2, $key2){
                return $item2->only(['locale', 'value']);
           });
           $item['translations'] = $item['translations']->filter(function ($item2, $key3) use ($admin_locale){
                return $item2['locale'] === $admin_locale;
           });
           $item['optionsWithTranslations'] = $item['optionsWithTranslations']->map(function ($item4, $key4) use ($admin_locale){
                $item4 =  $item4->only(['id', 'value', 'option_type_id', 'translations']);
                $item4['translations'] = $item4['translations']->map(function ($item4, $key4){
                   return $item4->only(['locale', 'value']);
                });
               $item4['translations'] = $item4['translations']->filter(function ($item5, $key5) use ($admin_locale){
                   return $item5['locale'] === $admin_locale;
               });

                return $item4;
           });
           return $item;
        });