app/Http/Controllers/ProductController.php

    public function __construct()
    {
        $this->dataType =  Voyager::model('DataType')->where('slug', '=', 'products')->first();
---
select * from `data_types` where `slug` = 'products' limit 1

    public function index()
    {
        $products = Product::all();
---
select * from `products` where `products`.`deleted_at` is null

    public function edit($id)
    {
        $product = Product::findOrFail($id);
        $pro_options = $product->options->modelKeys();
        return  view('vendor.voyager.products.edit',
            [
                'dataType'              => $this->dataType,
                'isModelTranslatable'   => $this->isModelTranslatable,
                'usesSoftDeletes'       => $this->usesSoftDeletes,
                'edit'                  => true,
                'categories'            => Category::all(),
                'brands'                => Brand::all(),
                'product'               => $product,
                'pro_options'           => $pro_options
            ]);
---
select `options`.*, `product_options`.`product_id` as `pivot_product_id`, `product_options`.`option_id` as `pivot_option_id` from `options` inner join `product_options` on `options`.`id` = `product_options`.`option_id` where `product_options`.`product_id` = 2
select * from `categories` where `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null

    public function productsByCategory(Category $category, Request $request){
        $products = Product::where('category_id', '=', $category->id);
        $products = $products->where('active', 1);
        $current_min_price = $products->min('price');
        $current_max_price = $products->max('price');
---
select min(`price`) as aggregate from `products` where `category_id` = 2 and `active` = 1 and `products`.`deleted_at` is null
select * from `products` where `category_id` = 2 and `active` = 1 and `products`.`deleted_at` is null
select max(`price`) as aggregate from `products` where `category_id` = 2 and `active` = 1 and `products`.`deleted_at` is null

            [
                'category' => $category,
                'products' => $products->latest()->paginate(10),
                'brands'   => Brand::all(),
---
select * from `brands` where `brands`.`deleted_at` is null

    public static function getNewProducts($category_id = null){
        if ($category_id === null){
            $categories = Category::where('parent_id' , '!=' , null)->get();
            $categories = $categories->filter(function ($category){
                return $category->products->count() > 0;
---
select * from `categories` where `parent_id` is not null and `categories`.`deleted_at` is null
select * from `products` where `products`.`category_id` = 2 and `products`.`category_id` is not null and `products`.`deleted_at` is null